<?php

namespace App\Http\Controllers\Common;

class ErrorCode
{
    public function ErrCodeReference()
    {
        return [
            '0' => '查詢成功',
            '2' => '發生錯誤',
            '16' => '檔案已經上傳完畢',
            '17' => '該檔案從未上傳',
            '18' => '該檔案需續傳',
            '19' => '檔案切片全部上傳完成，即將進行合併',
            '20' => '檔案上傳成功',
            '21' => '發生異常錯誤，檔案上傳失敗',
            '22' => '切片數量與請求數量不一致，無法合併，請重新上傳一次',
            '23' => '檔案合併成功',
            '24' => '切片檔案不存在，請重新確認',
            '100' => '%s',
        ];
    }
}
